Repository: UniqJade/Margin
Catalog: Resources/App/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Advanced
zh_hans: 高级

source: Also
zh_hans: 其他读法

source: API key (leave blank to keep the saved key)
zh_hans: API 密钥（留空以保留已保存的密钥）

source: API key deleted.
zh_hans: API 密钥已删除。

source: Appearance
zh_hans: 外观

source: Apple Books did not copy a selection. Select a word or passage, then press ⌃⌥M again.
zh_hans: Apple Books 未能复制所选文本。请选择单词或段落，然后再次按下 ⌃⌥M。

source: Apple Books did not provide selected text.
zh_hans: Apple Books 未提供所选文本。

source: Apply
zh_hans: 应用

source: Base URL or /chat/completions URL
zh_hans: 基础 URL 或 /chat/completions URL

source: BYOK is intended for a locally built personal prototype. A public release must use an authenticated backend relay.
zh_hans: 自备 API 密钥仅适用于本地构建的个人原型。公开发布时必须改用经过身份验证的后端中转服务。

source: Cached
zh_hans: 已缓存

source: Cancel
zh_hans: 取消

source: Certified translation provider
zh_hans: 认证翻译服务

source: Clear
zh_hans: 清除

source: Clear saved items
zh_hans: 清除收藏内容

source: Clear all saved items?
zh_hans: 清除所有收藏内容？

source: Clear cache
zh_hans: 清除缓存

source: Clear diagnostic events
zh_hans: 清除诊断事件

source: Clear diagnostic events?
zh_hans: 清除诊断事件？

source: Clear diagnostics
zh_hans: 清除诊断记录

source: Clear translation cache?
zh_hans: 清除翻译缓存？

source: Clear translation cache
zh_hans: 清除翻译缓存

source: Close
zh_hans: 关闭

source: Close dictionary
zh_hans: 关闭词典

source: Close translation
zh_hans: 关闭翻译

source: Cloud provider
zh_hans: 云服务提供商

source: Collapse original
zh_hans: 收起原文

source: Collapsed
zh_hans: 已收起

source: Complete the translation provider settings first.
zh_hans: 请先完成翻译服务设置。

source: Connect DeepSeek
zh_hans: 连接 DeepSeek

source: Connection works. You can start reading.
zh_hans: 连接成功，可以开始阅读了。

source: Context without leaving the page
zh_hans: 不离开书页，读懂上下文

source: Contextual Reading for Apple Books
zh_hans: Apple Books 上下文阅读助手

source: Copy
zh_hans: 复制

source: Custom OpenAI-compatible endpoints remain available as a future compatibility option in Settings. Margin does not certify their translation quality.
zh_hans: 设置中仍保留自定义 OpenAI 兼容接口，作为未来兼容入口；Margin 不对其翻译质量进行认证。

source: Custom OpenAI-compatible endpoints are retained for future compatibility. Margin does not test or certify their translation quality.
zh_hans: 自定义 OpenAI 兼容接口仅作为未来兼容入口保留；Margin 不测试或认证其翻译质量。

source: Custom provider active
zh_hans: 自定义服务已启用

source: Dark
zh_hans: 深色

source: DeepSeek API key
zh_hans: DeepSeek API 密钥

source: DeepSeek defaults restored. Click Save settings or Save and test.
zh_hans: 已恢复 DeepSeek 默认值。请点击“保存设置”或“保存并测试”。

source: Delete API key
zh_hans: 删除 API 密钥

source: Diagnostic events
zh_hans: 诊断事件

source: Diagnostics contain request status and format checks only, never selected text, translations, API keys, or raw responses.
zh_hans: 诊断记录仅包含请求状态和格式检查，不会包含所选文本、译文、API 密钥或原始响应。

source: Done
zh_hans: 完成

source: Edit selection
zh_hans: 编辑所选文本

source: English and Chinese semantic alignment
zh_hans: 英文与中文语义对齐

source: Expand original
zh_hans: 展开原文

source: Expanded
zh_hans: 已展开

source: Follow System
zh_hans: 跟随系统

source: Follow System changes automatically with this device. Light and Dark affect Margin only.
zh_hans: “跟随系统”会随本设备自动变化；浅色和深色仅影响 Margin。

source: History
zh_hans: 历史记录

source: In Apple Books, select text and press ⌃⌥M
zh_hans: 在 Apple Books 中选择文本，然后按下 ⌃⌥M

source: In Apple Books: select text, then press ⌃⌥M.
zh_hans: 在 Apple Books 中选择文本，然后按下 ⌃⌥M。

source: Light
zh_hans: 浅色

source: Literal view
zh_hans: 字面语义

source: Local storage
zh_hans: 本地存储

source: Look Up English Text
zh_hans: 查询英文文本

source: Look Up Text
zh_hans: 查询文本

source: Look up
zh_hans: 查询

source: Look up text…
zh_hans: 查询文本…

source: Lookup
zh_hans: 查询

source: Lookup history
zh_hans: 查询历史

source: Lookup unavailable
zh_hans: 暂时无法查询

source: Margin asks for Accessibility access only after you press the shortcut for the first time.
zh_hans: 只有首次按下快捷键后，Margin 才会请求辅助功能权限。

source: Margin uses deepseek-v4-flash with structured JSON output for its certified translation experience.
zh_hans: Margin 使用 deepseek-v4-flash 和结构化 JSON 输出提供经过认证的翻译体验。

source: Margin uses deepseek-v4-flash for its certified translation experience. Your API key stays in this device's Keychain.
zh_hans: Margin 使用 deepseek-v4-flash 提供经过认证的翻译体验。API 密钥只保存在本设备的钥匙串中。

source: Model ID
zh_hans: 模型 ID

source: Natural Chinese translation
zh_hans: 自然中文译文

source: Natural Translation
zh_hans: 自然译文

source: Natural translation: %@
zh_hans: 自然译文：%@

source: No lookups yet
zh_hans: 暂无查询

source: No saved items
zh_hans: 暂无收藏

source: Not saved
zh_hans: 未收藏

source: Only selected text and the language/style settings are sent. The API key is stored device-only in Keychain and is never written to preferences or history.
zh_hans: 仅会发送所选文本与语言、风格设置。API 密钥只保存在本设备的钥匙串中，不会写入偏好设置或历史记录。

source: Original English text
zh_hans: 英文原文

source: ORIGINAL
zh_hans: 英文原文

source: Only lookups you explicitly save appear here.
zh_hans: 这里只显示你主动收藏的查询。

source: Other readings: %@
zh_hans: 其他读法：%@

source: Paste or type a word or passage
zh_hans: 粘贴或输入单词或段落

source: Passage reading mode
zh_hans: 段落阅读模式

source: Privacy
zh_hans: 隐私

source: Quick setup
zh_hans: 快速设置

source: Quit Margin
zh_hans: 退出 Margin

source: Read English. Stay in the book.
zh_hans: 读英文，不离开书页。

source: Reading the context…
zh_hans: 正在理解上下文…

source: Refining the natural translation…
zh_hans: 正在润色自然译文…

source: Reading mode
zh_hans: 阅读模式

source: Remove from saved
zh_hans: 从收藏中移除

source: Remember lookups
zh_hans: 记住查询

source: Reset to DeepSeek
zh_hans: 重置为 DeepSeek

source: Retry
zh_hans: 重试

source: Save
zh_hans: 收藏

source: Save and test
zh_hans: 保存并测试

source: Save settings
zh_hans: 保存设置

source: Saved
zh_hans: 已收藏

source: Saved items
zh_hans: 收藏内容

source: Saved items and your API key will not be affected.
zh_hans: 收藏内容和 API 密钥不会受到影响。

source: SEMANTIC ALIGNMENT
zh_hans: 语义对齐

source: Semantic Alignment
zh_hans: 语义对齐

source: Semantic alignment was not generated for this lookup.
zh_hans: 本次查询未生成语义对齐。

source: Selections you look up appear here when local history is enabled.
zh_hans: 启用本地历史后，查询过的文本会显示在这里。

source: Select a word or passage, open the Share Sheet, then choose Look Up with Margin.
zh_hans: 选择单词或段落，打开共享表单，然后选择“用 Margin 查询”。

source: Select a word or passage, then press ⌃⌥M. Margin asks for Accessibility access only after you press the shortcut for the first time.
zh_hans: 选择单词或段落，然后按下 ⌃⌥M。只有首次按下快捷键后，Margin 才会请求辅助功能权限。

source: Selected text
zh_hans: 所选文本

source: Set up later
zh_hans: 稍后设置

source: Settings
zh_hans: 设置

source: Settings saved.
zh_hans: 设置已保存。

source: Setup
zh_hans: 设置向导

source: Show setup guide again
zh_hans: 再次显示设置向导

source: Speak
zh_hans: 朗读

source: Testing the DeepSeek connection…
zh_hans: 正在测试 DeepSeek 连接…

source: Testing the provider connection…
zh_hans: 正在测试服务连接…

source: Technical details
zh_hans: 技术详情

source: The selection stays available if the request fails.
zh_hans: 即使请求失败，所选文本也会保留。

source: This cannot be undone.
zh_hans: 此操作无法撤销。

source: This cannot be undone. The translation cache and API key will not be affected.
zh_hans: 此操作无法撤销。翻译缓存和 API 密钥不会受到影响。

source: Translate an English word or passage into natural Simplified Chinese.
zh_hans: 将英文单词或段落翻译为自然的简体中文。

source: Translation note: %@
zh_hans: 翻译说明：%@

source: Translation cache
zh_hans: 翻译缓存

source: Translations, saved items, cache entries, and your API key will not be affected.
zh_hans: 译文、收藏内容、缓存条目和 API 密钥不会受到影响。

source: Unsave
zh_hans: 取消收藏

source: Use Margin in Apple Books
zh_hans: 在 Apple Books 中使用 Margin

source: Uses the current Flash model and JSON mode.
zh_hans: 使用当前 Flash 模型与 JSON 模式。

source: Welcome to Margin
zh_hans: 欢迎使用 Margin

source: Word
zh_hans: 单词

# 自然译文
source: NATURAL TRANSLATION
zh_hans: 自然译文
